[
  {
    "title": "SoulMate",
    "description": "A modern and secure matrimonial platform where users can create detailed biodata, explore matches, and share marriage success stories. The platform offers a premium membership system and personalized dashboards for a smooth experience.",
    "features": [
      "Create and manage biodata with role-based access (User/Admin)",
      "Send, approve, and track contact requests with premium visibility",
      "Share and browse marriage success stories with reviews and images"
    ],
    "technologies": [
      "React",
      "Tailwind CSS",
      "Firebase",
      "Express.js",
      "MongoDB"
    ],
    "githubLink": "https://github.com/ana-yet/soulmate-client",
    "liveLink": "https://soul-m-ate.vercel.app",
    "imageUrl": "https://i.ibb.co.com/Xxt7ND5k/soulmate.webp"
  },
  {
    "title": "Service Review System",
    "description": "A full-featured review platform where users can explore services, leave ratings, and manage personal feedback. Built with secure authentication and a responsive, interactive UI.",
    "features": [
      "Users can leave reviews and star ratings for services",
      "User dashboard showing personal services and reviews",
      "Responsive UI for mobile and desktop devices",
      "Filter/search services by category or name"
    ],
    "technologies": [
      "React",
      "Tailwind CSS",
      "Express.js",
      "MongoDB",
      "Firebase",
      "JWT Authentication"
    ],
    "githubLink": "https://github.com/ana-yet/review-sys-client",
    "liveLink": "https://review-system-app.web.app/",
    "imageUrl": "https://i.ibb.co.com/5X4svNQm/recipe.webp"
  },
  {
    "title": "Recipe Book",
    "description": "A visually-rich and interactive recipe-sharing platform designed for both beginners and seasoned cooks. Users can browse, upload, and manage recipes through a personalized dashboard with smooth animations and a delightful UI experience.",
    "features": [
      "Explore categorized dishes including Bachelor’s Meals and Beginner special",
      "Like and interact with other users’ recipes (excluding own)",
      "Detailed recipe view with ingredients, instructions, and cooking info",
      "Responsive UI with image sliders, hover effects, and tooltips",
      "Search and filter functionality across public recipe catalog"
    ],
    "technologies": [
      "React",
      "Tailwind CSS",
      "Firebase",
      "Express.js",
      "MongoDB"
    ],
    "githubLink": "https://github.com/ana-yet/recipe-book-client",
    "liveLink": "https://recipe-book-525e2.web.app/",
    "imageUrl": "https://i.ibb.co.com/DgGXsZZw/service-review.webp"
  }
]
